tap "charmbracelet/tap"
tap "felixkratz/formulae"
tap "gromgit/brewtils"
tap "lhvy/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "sst/tap"
tap "valkyrie00/bbrew"
brew "atuin"
brew "libgit2"
brew "bat"
brew "biome"
brew "bottom"
brew "btop"
brew "isl"
brew "gcc"
brew "open-mpi"
brew "fftw"
brew "iniparser"
brew "portaudio"
brew "cava"
brew "chezmoi"
brew "cmake-language-server"
brew "cmatrix"
brew "dart-sdk"
brew "deno"
brew "node"
brew "dockerfile-language-server"
brew "eslint", link: false
brew "eza"
brew "fastfetch"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gitui"
brew "glow"
brew "go"
brew "gping"
brew "imagemagick"
brew "jdtls"
brew "jq"
brew "just"
brew "kotlin-language-server"
brew "lazygit"
brew "llvm"
brew "lua"
brew "lua-language-server"
brew "marksman"
brew "mosh"
brew "ncspot"
brew "neovim"
brew "nushell"
brew "p7zip"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "poppler"
brew "posting"
brew "rclone"
brew "repomix"
brew "resvg"
brew "ripgrep"
brew "rust"
brew "sevenzip"
brew "speedtest-cli"
brew "spotifyd"
brew "sql-language-server"
brew "starship"
brew "tailwindcss-language-server"
brew "taplo"
brew "television"
brew "texlab"
brew "toilet"
brew "tree"
brew "tty-clock"
brew "typescript", link: false
brew "typescript-language-server", link: false
brew "unzip"
brew "uv"
brew "vscode-langservers-extracted"
brew "wallpaper"
brew "xh"
brew "yaml-language-server"
brew "yazi"
brew "zinit"
brew "zls"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "charmbracelet/tap/crush"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "gromgit/brewtils/taproom"
brew "lhvy/tap/pipes-rs"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
brew "valkyrie00/bbrew/bbrew"
cask "aerospace"
cask "blackhole-2ch"
cask "docker-desktop"
cask "flameshot"
cask "font-barlow"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monocraft"
cask "font-symbols-only-nerd-font"
cask "neovide-app"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "ajshortt.tokyo-hack"
vscode "alefragnani.numbered-bookmarks"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "alexey-strakh.stackoverflow-search"
vscode "almenon.arepl"
vscode "anseki.vscode-color"
vscode "anthropic.claude-code"
vscode "antyos.openscad"
vscode "bar.python-import-helper"
vscode "batisteo.vscode-django"
vscode "bodil.prettier-toml"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "ccimage.jsonviewer"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "cstrap.python-snippets"
vscode "dakshmiglani.hex-to-rgba"
vscode "dart-code.dart-code"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbcode.dbcode"
vscode "deerawan.vscode-dash"
vscode "deerawan.vscode-faker"
vscode "demystifying-javascript.python-extensions-pack"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dorianmassoulier.repomix-runner"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "ex-codes.pine-script-syntax-highlighter"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-codeql"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "hbenl.vscode-test-explorer"
vscode "hilleer.yaml-plus-json"
vscode "hsnazar.hyper-term-theme"
vscode "humao.rest-client"
vscode "hyprluna.hyprluna-theme"
vscode "igordvlpr.open-in-browser"
vscode "james-yu.latex-workshop"
vscode "kaih2o.python-resource-monitor"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "leathong.openscad-language-support"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "microsoft-isvexptools.powerplatform-vscode"
vscode "mintlify.document"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-sarifvscode.sarif-viewer"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nefrob.vscode-just-syntax"
vscode "nickdemayo.vscode-json-editor"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "poml-team.poml"
vscode "postman.postman-for-vscode"
vscode "prateekmahendrakar.prettyxml"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "ripplejs.ripple-vscode-plugin"
vscode "rpinski.shebang-snippets"
vscode "rust-lang.rust-analyzer"
vscode "saatvik333.wallust-theme"
vscode "sandipchitale.kubernetes-file-system-explorer"
vscode "selemondev.vscode-shadcn-svelte"
vscode "shuffle-dev.shuffle-dev"
vscode "softwaredotcom.swdc-vscode"
vscode "stevenallenking.python-string-syntax-highlight"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "thebarkman.vscode-djaneiro"
vscode "tobiashochguertel.just-formatter"
vscode "tomoki1207.pdf"
vscode "trabpukcip.wolf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "wix.vscode-import-cost"
vscode "xirider.livecode"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "ziyasal.vscode-open-in-github"
go "github.com/nametake/golangci-lint-langserver"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
